[{"title":"2023 Wrap-Up: Startup Success Stories","description":"No Description","content":"As we close out another remarkable year at Startup Grind, it’s time to reflect on a few of the incredible milestones reached by startups within our community. We’re grateful to be a small part of their journeys so far and can’t wait to see what the future holds for these promising companies!In 2023, ZIM Connections Limited witnessed an astonishing 903.9% growth in sales. This dynamic startup graced the stages of renowned global events, including MWC, DTW, InnovX, and VDS, earning accolades such as being selected among the top 50 and winning pitch competitions. Featured in prestigious publications like The Times, The Fast Mode, and Techacute, ZIM also successfully closed a crowdfunding campaign on Seedrs.Their B2B channel is flourishing, with partnerships sealed with industry giants such as Aramco, Allianz, SBB Switzerland, and Trip.com. Collaborations with telecom partners like AT&amp;T and Orange, alongside inclusion in the esteemed TM forum, mark ZIM’s exceptional journey in 2023.Fluree’s success story is a testament to the power of connections within the startup ecosystem. Co-founder and CEO Brian Platz acknowledges the pivotal role Startup Grind played in their journey, leading to a significant 10M funding in April 2023. Having exhibited at our Global Conference in 2020 and 2022, Fluree is not just a success story but a cherished member of our startup community.Feedcoyote, with its web and mobile apps, has leaped forward with the launch of its 3rd version. Boasting 10,000+ active users spanning 120+ countries, the startup is growing at an impressive rate of 180% MoM, welcoming over 1,000 new users weekly. As a Techstars portfolio company, Feedcoyote has secured victories in six startup pitch competitions in the past year, including Render Capital, 1st50k, 5 Across, Ideathon, Vogt Awards, and KY Inno Madness. Their global impact is undeniable, as they continue to redefine success in the tech space.Readmio’s journey from its 2020 launch to raising 1M Euro investment in 2023 is nothing short of extraordinary. Having expanded internationally to Poland, Germany, Italy, and Spain, Readmio now boasts 10,000 paying subscribers. The company’s commitment to promoting family bonding through reading has resulted in over 4.2 million stories shared globally. Selected for the Scale to USA accelerator Rubik Garage, Readmio sets its sights on conquering the US market in 2024, doubling revenue year over year and aiming for profitability.Otis AI showcased its mission to simplify marketing strategies at our conference and emerged victorious as the Startup of the Year at Global. Their dedication to making digital marketing accessible for small and medium businesses is just the beginning of their journey. With $2.5M raised already, Otis AI continues to scale, proving that simplicity and effectiveness can indeed coexist in the realm of digital marketing.These accomplishments truly exemplify the spirit of collaboration that defines our startup community. Whether you’re a founder, investor, or aspiring entrepreneur, we hope in 2024 you’ll get involved in your local Startup Grind chapter and join us at our annual Global Conference in Silicon Valley.Startups can apply here to exhibit at Global 2024 and become a part of the next wave of success stories.","link":"https://startupgrind.medium.com/2023-wrap-up-startup-success-stories-7c9e67595957?source=rss-a81d7d77d923------2","pubDate":"Tue, 05 Dec 2023 15:59:01 GMT"},{"title":"Startup of the Year 2023: OTIS","description":"No Description","content":"The results came in live on the Global Conference 2023 mainstage and Otis was crowned Startup of the Year! We sat down with Founder &amp; CEO, Miguel Guerrero, afterward to talk about the achievement and what it took to get to this point in his team’s startup journey.Congratulations on winning Startup of the Year at Global 2023! How did you feel when it was announced?Winning Startup of the Year at Global Conference 2023 was a fantastic moment. I feel excited and thankful for the recognition, especially for the hard work that our great team has put into building Otis. Being recognized among such talented and innovative startups at the conference was an honor.How would you describe your experience overall as an exhibitor at the conference, and what have been the most exciting results?Our experience as an exhibitor at the conference was great. We had the opportunity to showcase Otis to a diverse audience of industry professionals, investors, and potential clients. The most exciting result has been the overwhelming interest and positive feedback we received. Many attendees expressed enthusiasm for our AI-driven marketing platform and saw its potential for their businesses. Some of the VCs we met even invested in Otis.What led you to start OTIS, and what inspired you to pursue this idea?The inspiration behind starting Otis stemmed from a realization that small and medium businesses needed help to optimize their digital advertising efforts effectively. We wanted to level the playing field by providing these businesses with a user-friendly AI-powered platform. Our goal was to empower these businesses to achieve better marketing results, increase their return on investment, and compete with more prominent players in the market.Can you share how OTIS helps clients achieve better marketing results?Otis helps clients achieve better marketing results by leveraging our automated platform to launch and optimize their advertising campaigns. We analyze data, identify trends, and make intelligent optimizations for targeting, ad spending allocation, and optimization. This allows our customers to reach their target audience more effectively, improve campaign performance, and maximize their marketing ROI.As a startup founder, what have been some of the biggest challenges you’ve faced in growing and scaling your business?Like many startups, we have faced various challenges along our journey. One of the biggest challenges has been getting to product market fit through rapid iteration and improvement of our product. Additionally, scaling our operations while maintaining the high quality of our product has required careful planning and resource allocation. However, each challenge has presented an opportunity for growth and learning, enabling us to improve and evolve continuously.How do you approach hiring and building a team to support your startup’s growth?Hiring and building a talented team has been crucial to our growth. We prioritize individuals who are not only skilled and experienced but also aligned with our company culture and vision. We believe in fostering a collaborative and innovative environment where everyone has the opportunity to contribute and thrive. Building a diverse team with a shared passion for our mission has been instrumental in our success.What advice do you have for startup founders just starting or trying to grow their businesses?I advise other startup founders to stay resilient throughout their entrepreneurial challenges. Building a startup can be a demanding experience, even when things are going well. Embrace the journey and celebrate small victories along the way.What do you see as the future of AI in marketing, and how do you plan to adapt and evolve your solutions to stay ahead of the curve?The future of AI in marketing is incredibly promising. AI will play an increasingly significant role in helping businesses automate and optimize their marketing efforts. At Otis, we are committed to making powerful enterprise-level strategies simple and accessible for smaller companies. We stay ahead of the curve by continuously innovating and evolving our solutions. We invest in research and development to enhance our AI capabilities and remain at the forefront of industry trends. We aim to ensure that our business users have access to a simple, accessible and effective solution that delivers exceptional results and keeps them ahead of their competition.Want to exhibit your startup live at our next Global Conference in Silicon Valley? Apply here.","link":"https://startupgrind.medium.com/startup-of-the-year-2023-otis-1dcbb8ee704?source=rss-a81d7d77d923------2","pubDate":"Wed, 02 Aug 2023 01:42:41 GMT"},{"title":"Exhibitor Spotlight Q&A: Ayraa","description":"No Description","content":"Founder BioThe founders, Vinay Mahadik &amp; Nikita Chikate, previously built the largest EdTech NLP/ML AI-based student safety platform (www.securly.com), where they launched 10+ B2B SaaS products under their leadership (CEO/Head of Product and Chief Design Officer, respectively), growing 80% CAGR for seven years to an exceptionally successful exit to a PE firm. Before Securly, Vinay was a Senior R&amp;D Manager at McAfee, leading four multi-million dollar product lines, and Niki was a Lead Designer at Citrix. Both the founders individually have 20+ years of Enterprise product-development experience. Vinay has an MBA from Wharton, while Niki has an MBA in Design Strategy from California College of Arts.In a sentence, what does Ayraa do?Ayraa enables you to discover, organize &amp; search knowledge from across the company — as it happens.How and when did Ayraa come to be?When the founders of Ayraa were scaling their previous startup, the #1 issue they faced in the fast growth environment was keeping the company operating in lock-step with each other regarding knowledge &amp; communications. Important features released, new product launches, key partnerships signed, new pricing sheets rolled out, competitive analysis documents made available, system outages and root-cause analyses, FAQs, new hires, significant HR policy changes, and so much more. The genesis of Ayraa was the singular mission of solving this issue of keeping the employees informed.What makes your company/product different in this market?Knowledge management &amp; search is a rapidly developing &amp; exciting product category.The incumbents are primarily old-school Wikis &amp; Intranet companies. These solutions require a lot of collective effort in organizing &amp; maintaining, and so are always trailing behind.A handful of new entrants cover various permutations of enterprise search, knowledge collections &amp; shortcut links. These are powerful tools, and we also support them. However, Ayraa’s unique positioning is that it is the only platform that provides a self-organizing push model for knowledge. Put simply, Ayraa enables information to be disseminated, organized &amp; discovered in real-time as it happens. We have spent over a year building slick interfaces for publishing information across the workspace as it happens. You no longer have to maintain a collection or a Wiki/Intranet page. You also don’t have to search for information as it naturally comes to you. With Ayraa, everyone stays informed continuously. Knowledge gets filed and categorized automatically. If you do want to look something up, natural language search &amp; query allow you to recall and probe this information instantly.What milestone are you most proud of so far?We are most proud of our ability to gather market feedback and pivot rapidly to find product market fit. We shared a private preview of our product at SXSW and rapidly pivoted to a knowledge-management discover, organize &amp; search positioning based on the collective intelligence gathered from over 350 conversations from the event.Have you pursued funding, and if so, what steps did you take?We raised a seed round in the second half of 2021. Our current focus is on launching &amp; shaping the product to fit our long-term vision best.What is your vision for the next 10 years?Ayraa has an expansive definition of organizational knowledge. For our launch, we bring to you — headline updates, strategic memos &amp; summaries from discussions across the company. At scale, we envision a broad platform that covers wellness, communications, learning, and other related areas — all emanating from a core knowledge engine, much like a brain that powers an intelligent workplace.How do you build and develop talent?We have built a globally distributed team but with an emphasis on creating clusters around central hubs where remote employees can still meet &amp; bond in person once every few weeks. This model has kept our team morale &amp; retention high. A large fraction of our hiring was through referrals. We have a strong layer of leadership — with the co-founders covering Product &amp; Design, while others covering Growth, DevOps, and Engineering.How do you manage growth vs sustainability?As we haven’t launched publicly yet, our primary focus on sustainability is via positioning. Every product decision we make involves creating a blue ocean that makes competition irrelevant.How was your experience at Startup Grind Global ‘23?We loved it. After over a year and a half of being heads down in build mode, it was great to have hundreds of conversations with fellow startups and investors to validate some of our assumptions and shape our product market fit. We discovered our top pivot from communications to knowledge management at SG Global ’23 as a result of these conversations.What are the biggest challenges for the team?Ayraa started with a singular mission of eliminating information silos and keeping the employees informed. In the pre-GPT part of our journey, we approached this problem using a communication platform. Then, GPT happened — forcing us to factor in the latest advancements in AI into this vision — and completely rethinking our approach. After hundreds of conversations at SXSW ’23 and SG Global ’23, we finally figured out a breakthrough approach that leverages our 18+ months of work on real-time communications and blends in knowledge management &amp; search seamlessly into it — creating a unique positioning in this exciting new market.Want to exhibit your startup live at our Global Conference in Silicon Valley? Apply here.","link":"https://startupgrind.medium.com/exhibitor-spotlight-q-a-ayraa-40368b87e549?source=rss-a81d7d77d923------2","pubDate":"Mon, 03 Jul 2023 20:15:50 GMT"},{"title":"Top US Startups to Watch at Global 2023","description":"No Description","content":"The Global Conference Startup Exhibition is just around the corner, and we couldn’t be more excited to showcase some of the most innovative startups. With 145 startups exhibiting from 39 different countries, this year’s exhibition promises to be a melting pot of cutting-edge ideas and revolutionary technologies.Of these startups, almost half are from the United States, reflecting the country’s thriving entrepreneurial landscape. In this article, we’ll take a closer look at some of the top US startups exhibiting at the conference and the exciting ways they are changing the world.Zen SleepIndustry: HealthCareZen Sleep is the Noom / Modern Health for sleep. They work with employers, payors, and partners to help their constituents build better sleep backed by the proven science of Cognitive Behavioral Therapy for Insomnia.Thr1ftIndustry: E-commerceThr1ft is a marketplace that makes the hunt for high quality fashion easier. They aggregate secondhand &amp; sustainable fashion from stores, sellers and brands that exist online into one seamless shopping experience.SenpexIndustry: Logistics / Supply ChainSenpex is a last mile Logistics Solutions for E-Commerce (Marketplace &amp; Online Ordering Platforms). It can help you scale your coverage in multiple states with AI-based innovative solutions like Senpex API, Routes Optimization Tool, &amp; In-House SaaS.ParchmentIndustry: Information Technology / ServicesParchment is a software company, who is building a new desktop for the computer by combining the best of internet and local experiences.Pelorus HealthIndustry: Health CarePelorus Health helps caregivers and their children with type 1 diabetes transition to independent health management through health monitoring tools, education, and community support.Strike GraphIndustry: CybersecurityStrike Graph’s compliance operation and certification platform offers an easy, scalable, and efficient way to achieve compliance — from SOC 2 to ISO 27001 to GDPR and beyond.Ranae Wellness CompanyIndustry: Wellness / FitnessRanae Wellness Company is eliminating the confusion and stress that comes with taking control of our health by offering a highly personalized wellness coaching and shopping care experience.Transition Squad USAIndustry: E-commerceTransition Squad is a full service downsizing franchisor for seniors with a proprietary online auction platform that offers DIY and managed services through online auctions, estate sales and consignment.Xponent PowerIndustry: Renewable / EnvironmentXponent™ Power is a disruptive renewable energy company whose key innovation is a patented, ultra-compact, sensor-enabled, intelligent retractable solar technology platform that can be mounted on any surface, enabling solar deployment in applications where no roof space is available.Sunny SolutionsIndustry: Consumer Goods / ServicesThey produce a gadget in the form of a robot. This Robot is designed for personal use or shared use by 2–5 people. It allows performing part of the work that a person does. Specially trained operators are ready to connect through the robot to solve more complex professional tasks.Tengri Tech CorpIndustry: AR / VRThey are creating virtual showrooms for home builders by turning 2D floor plans into 3D tours. It provides virtual showrooms for real estate developers so they can present what they are building before the construction is done.SMARTChartsIndustry: Health CareSMARTCharts is a web-based application that automates clinician documentation and facilitates communications via visualization in speech, occupational and physical therapy. It is a patient-first, clinician-driven productivity app serving care teams in speech, occupational and physical therapy.VanOnGoIndustry: Logistics / Supply ChainSaas Delivery orchestration platform that connects brands and delivery partners, and digitalizes last-mile delivery processes towards more orders generation.Somavedic TechnologiesIndustry: Wellness / FitnessSomavedic is an always-on, rest and recovery frequency therapy device that harmonizes our bodies. Its field has therapeutic effects on our cells, which manifests in improved sleep, cellular regeneration, energy levels, and productivity.QuickLoadz Intermodal RoboticsIndustry: Logistics / Supply ChainQuickLoadz is new hardware that automates the movement of 90% of the world’s freight. It is the only company in the world which has developed a fundamentally better way to physically move those containers.Bettor VisionIndustry: SportsThey found that too many avid sports fans waste valuable time checking multiple apps to track the performance of all their traditional fantasy matchups, daily fantasy contests, and sports bets.Bettor vision is a free mobile app that aggregates those accounts to allow consumers to have a better view of all their accounts and contests in one place. We provide an easily digestible dashboard for a quick high-level summary of performance as well as more detailed views for price comparison, research, and analysis to ensure consumers are getting the best deals and making better, more informed decisions.iSportz Inc.Industry: SportsiSportz is a scalable, end-to-end Sports Management and Engagement Platform helping organizations of all sizes grow and thrive by creating a more connected global sports ecosystem.EducationXRIndustry: AR / VREducationXR is an immersive training and education platform technology that addresses creation, deployment, and distribution of immersive content to all phones, tablets, desktops, and VR headsets. Content created with EducationXR is automatically multiplayer and users can connect together remotely regardless of device and regardless of location.SpikeviewIndustry: EducationSpikeview is the next-gen portfolio builder that is enabling the global youth community to lean in on their multidisciplinary expertise to forge a pathway to success.CEEK MetaverseIndustry: BlockchainCEEK VR is a metaverse platform that connects creators with their fans in virtual worlds through NFTs, virtual events and unique experiences; allowing music artists, sports teams and influencers to gain new sources of income. CEEK is the in-world utility token for the CEEK Metaverse featuring the likes of Dwayne Wade, Lady Gaga and Bon Jovi.MEPAIndustry: Marketing / Advertising / SalesMEPA is the newest marketing and advertising platform to transform the way we share ad content. It’s app allows users to swipe on advertising content (promotions, deals, coupons, events, etc.) in a set radius to support optimal local discovery.MavityIndustry; Design / GraphicsMavity connects businesses with distributed creative teams through an automated project-manager-as-a-service tool and collaboration platform.Corporate TravelerIndustry: TravelCorporate Traveler is a powerful travel tech + human support that specializes in travel arrangements for startup companies.HR GeckosIndustry: Human ResourcesHR Geckos is a cloud-hosted AI-powered HR Operations platform that automates all HR tasks and business processes. They cut down the time and resources to provide HR services making HR as agile as a gecko.Wisdom MedicineIndustry: Health CareWisdom gives women with autoimmunity and hormone issues personalized functional medicine care from a doctor and nutritionist for $175 / month. It is a Women-centric functional medicine care for hormone &amp; autoimmune issues.Mishka AIIndustry: Consumer Goods / ServicesTheir platform helps toy manufacturers produce connected plush toys at low retail prices. With subscription-based content updates, they support parents on their mission of raising happy kids.https://startupgrind.tech/conference/Top US Startups to Watch at Global 2023 was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/top-us-startups-to-watch-at-global-2023-800f98cafbf1?source=rss-a81d7d77d923------2","pubDate":"Mon, 03 Apr 2023 16:23:53 GMT"},{"title":"Top Europe Startup Exhibitors to watch for at Global 2023","description":"No Description","content":"This year, our Global Conference is featuring some of the top Europe-based startups that are making waves in the industry. From cutting-edge technology to game-changing business models, these startups are at the forefront of innovation and are paving the way for the future. In this article, we will highlight some of the standout startups you can expect to see at our conference.CodeMonk.AI, United KingdomIndustry: Human ResourcesPlatform for start-ups to build high-performing tech teams of pre-vetted talents using a proprietary machine learning algorithm. With an easy-to-use online dashboard start-ups can scale their tech teams anywhere within days rather than months.RAB Microfluidics, United KingdomIndustry: Hardware / IoTRAB Microfluidics is enabling real-time oil monitoring. They diagnose early signs of failure in lubricated machinery and prevent equipment failure using our patented microfluidic technology and AI technology.FS TEKNOLOJI AŞ, TurkeyIndustry: SportsFanSupport is the unique digital conditional support platform to generate sustainable, transparent and traceable revenue for the global sports industry including clubs, associations, federations and athletes.LOV+R, FranceIndustry: OtherLove pods for festivals and events with a booking and dating app to create a community for sex-positivity and like-minded people.QuickLegal, RomaniaIndustry: Law / LegalBridging the gap between clients and top legal professionals. QuickLegal is a complete legal solution whose matchmaking algorithm connects users with the most suited specialized lawyers and brings them to interact in a fully remote, virtual office. Via RPA and AI technology. Redundant tasks are automated, legal information is instantly provided via robo-attorney, agreements are easily signed, standard documents filled out, and the reduced billable hours are easily charged and invoiced to clients.Vault Security Systems AG, SwitzerlandIndustry: Information Technology / ServicesVault Security Systems AG’s flagship brand ivault uses Blockchain technology to optimize supply chains for businesses and ensure asset tracking in a state of art matter. ivault also helps consumers through our patented innovative app to make this world a better place, through their sharing economy and lost and found function.TAPSTER MEDIA, GermanyIndustry: Entertainment / GamingAs a new, self-sufficient and fast-growing digital leisure medium, lively story is set to become an integral part of entertainment offerings worldwide. By breaking the boundaries between books, audiobooks, music, movies and special effects, lively story provides the next level of entertainment.OroraTech, GermanyIndustry: Renewable / EnvironmentOroraTech is the leading thermal-infrared data intelligence company providing actionable insights for sustainable enterprises. Their leading Wildfire Intelligence Solution is used by customers across six continents protecting more than 170 million hectares of forest.Vitamate, AustriaIndustry: Health CareVitamate is a digital nutrition coach that helps you achieve your health goals and provides recommendations based on your unique needs. You can track your progress and see results over time, whether you want to improve your overall health or prevent disease.Plasmics, AustriaIndustry: Hardware / IoTPlasmics is an Austrian startup focused on developing the next generation of 3D printing solutions. Their goal is to create a global decentralized production using 3D printing and AI quality control for small organizations and consumers.Menu Del Día, SpainIndustry: Food / BeverageEat like a local in any city. Discover restaurants and view real time menus updated daily with their platform.Innerspace GmbH, AustriaIndustry: PharmaceuticalsInnerspace has developed a novel analysis method “Frame-by-Frame Risk Profiling” that will create the most advanced database for process development and risk management in the life science industry. The data generated is up to 100 times more detailed than the current industry standard of analytical methods and therefore much more sensitive to process optimization and “hidden risks” that can have serious consequences for product quality and thus patient safety if not identified.Leeaf, Czech RepublicIndustry: Health CareEmpowering fertility treatments, Leeaf is a research-based and data-driven female health platform that transforms the assisted reproductive journey by delivering truly personalized fertility treatment recommendations to physicians and patients.WEARFITS, PolandIndustry: FashionWEARFITS is creating the Digital TAG — a global cloud platform for managing 3D assets and product information. It utilizes AR/XR and ML technologies, which enable our digital tools to improve online sales and reduce the return rates of apparel, footwear, and accessories.Top Europe Startup Exhibitors to watch for at Global 2023 was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/top-europe-startup-exhibitors-to-watch-for-at-global-2023-6d023612c0ad?source=rss-a81d7d77d923------2","pubDate":"Mon, 03 Apr 2023 13:52:00 GMT"},{"title":"Top 31 SaaS Startups to Watch at Global 2023","description":"No Description","content":"Software as a service (SaaS) has transformed the way businesses operate, with cloud-based solutions becoming the norm for everything from project management to customer service. At our upcoming Global Conference, we’re thrilled to feature some of the most innovative SaaS startups in the industry, whose technologies are revolutionizing the way we work.These startups are at the forefront of SaaS innovation, developing solutions that address some of the most pressing challenges facing businesses today. From improving employee collaboration to optimizing customer engagement, their technologies are driving efficiencies and unlocking new opportunities for growth.In the following article, we’ll delve deeper into the leading SaaS startups set to showcase their innovative solutions at our upcoming Global conference. Their products cater to a diverse range of business needs and industries, offering scalability, user-friendliness, and affordability to all entrepreneurs, whether they run small-scale operations or occupy Fortune 500 boardrooms. Join us to stay abreast of the latest SaaS trends and see how these startups are transforming the future of work.Video Chat A Pro, United StatesThey help home and auto owners get repair estimates in 20 minutes or less from local businesses. It also allows licensed certified technicians to connect with home and auto owners to instruct them to fix it themselves. It is a Digital Home and Auto Repair Service to Learn How to Fix it.Philanthrofi, United StatesPhilanthrofi is a B2B SaaS social enterprise using an A.I. driven platform to connect companies to the impact they aspire to create in the world. Their robust and intuitive matchmaking solution fosters sustainable and highly impactful partnerships between corporations and impact organizations through shared missions, visions &amp; values to transform corporate sustainability from a risk mitigation strategy to an investable commercial strategy.FAME App Company, South AfricaFAME App Company is a CRM Software and end-user engagement app for the content publishing industry. Their software, hosted online (SaaS) ensures an innovative and agile way to drive cross-channel relationships and centralized efforts while reclaiming ownership of the long-lost market share. It is one of the most contemporary solutions for content publishing and offers licensing packages for all levels of content producers from corporate publishers to free-lance users.PreSkale, United StatesPreSkale is an all-in-one platform for Sales engineering teams to track product performance pre-closure and accelerate the buyer journey. Their platform makes it easier for Sales engineering teams with best-fit resource assignments to improve technical sales closures, uncover product gaps and unblock hidden revenue.VIDA, GermanyVIDA is a map-based software company. They enable infrastructure investors, banks, governments &amp; energy companies to efficiently and reliably measure, monitor &amp; report their ESG impact. VIDA stands out as the leading solution for fusing customer data with up-to-date geospatial data and a suite of project management functionalities.Groc, United StatesGroc is like “Amazon Go” on your phone. They are a SaaS company making the world’s smoothest checkout experience. Shoppers skip the line, and stores save the sale that walked away. They have customers using their app, and undergoing integration with a B2B enterprise that hosts 30,000 potential sales.Evolusen, United StatesEvolusen is a B2B SaaS Influencer Management platform built for the Hospitality &amp; Travel Industry. Making Influencer Marketing more accessible, measurable, and streamlined with our software and network of vetted Influencers.NonBinary Solutions, United StatesNonBinary Solutions develops systems to power the next generation of autism service providers and their organizations. The value that NBS delivers to this market is the ability to dramatically improve the quality of care, reliability, and replicability of treatment outcomes. It is committed to providing software solutions for critical outcomes that affect thousands of people who are concerned with Quality of Life, and the demonstrated efficacy of applied behaviour analysis.Uhubs, United KingdomUhubs is a SaaS tool that helps sales teams hire more intelligently, ramp new hires faster and then close more deals quicker. They analyze a range of data sources to create a unique profile, and use AI to provide predictive coaching and training recommendations to close the performance gap.SuprSend, United StatesSuprSend is a flexible notification infrastructure for development teams to send notifications reliably across all channels. Create meaningful cross-channel workflows within hours instead of months, with built-in components for batching, routing, and preferences.Multitudes, New ZealandMultitudes integrates with engineering tools (e.g., Github, Linear) to provide dynamic, actionable insights that unlock happier, higher-performing, and more equitable teams. It improves engineering team performance and wellbeing with ethical, data-driven recommendations to unblock work, improve collaboration, and minimize burnout.ZIZO Technologies, United StatesZIZO is a workforce gamification platform which solves the challenges of low employee engagement and high turnover for enterprises, specifically in the call center industry. It improves the employee experience and retention by leveraging automation and game mechanics.Nowa, GermanyNowa is a next-gen platform that puts creativity in the heart of app development. It offers a platform for building native apps with stunning designs for all platforms visually, while keeping the freedom of using code at the same time.ByteNite, United StatesByteNite has created the world’s first grid computing system that powers high-throughput applications like video encoding, 3D rendering, and computer vision. Our distributed model is based on a patent-pending algorithm that parallelizes the workload efficiently gaining up to 10x in speed relative to standard cloud computing.Liquit, NetherlandsLiquit offers end-users simple yet dynamic application management, ensuring a consistent, customizable user experience across any device. They not only deliver it to devices, but we can also integrate the intelligent Liquit application Icons in portals like Microsoft Teams, Sharepoint and any other portal. It is a Game Changing End to end Application Management Platform. Any application, anywhere on any device.Mesibo, United StatesMesibo is a developer-centric communication platform (CPaaS) for developers to add real-time messaging, calls, conferencing, chatbot, etc. in their apps and website. The platform is live and already deployed by over 11,000 developers in over 40+ countries and some of their prominent customers are Venice Airport, Saudi Arabia Government, CapGemini, Moevd Indonesia, etc.Ayraa, United StatesAyraa is the world’s first enterprise communications SaaS stack, purpose-built for reliable &amp; structured communications in the workspace. Ayraa has taken the best of Email, Chat &amp; Wiki, and reimagined a new platform that creates a visual, self-organizing workspace.Quantumics.AI, United KingdomQuantumics is a no-code data platform to prepare and automate data in minutes targeted at citizen builders. It improves 90% efficiency at 10% of the cost.Mainstack, United StatesMainstack enables the creator economy with no-code tools to present their best works and receive payments globally. It is an all-in-one platform for non-technical entrepreneurs and creators to showcase and receive payments for their works. They exited public-beta last month at TechCrunch in SF with 20,000+ users in 105+ countries.KOLONUS, MexicoKOLONUS digitalizes the end-to-end processes involved in Buildings and Gated Communities, helping Residents/tenants, Property Managers and Security Guards. It is a Proptech SuperApp for gated communities and apartments.Sakari, United StatesSakari enables SMBs to send personalized SMS messages to customers at scale via their web and mobile apps or via integrations with third party platforms. SMS has a 98% read rate and is one of the most effective channels of communication.Neula, PolandNeula is an AI-boosted low-code platform that provides ready-to-use business apps and an environment to build your own app in a few simple steps. The solution has proven to be successful with a number of local clients in such areas as invoice processing, GDPR, claims handling, etc.Indy, United StatesIndy is on a mission to empower Freelancers, by providing them easy to use, affordable and innovative productivity tools &amp; services that enable them to control, grow and stabilize their work life. It provides an all-inclusive-productivity-solution for freelancers, that includes a back office software, networking platform and university.OneTeg, United StatesOneTeg is a No-code iPaaS exchange platform, enabling easy integration between systems. Unifies content &amp; data using user-driven Flows allowing for a simplified Integration across platforms. OneTeg focuses on the eCommerce and Marketing ecosystem to ease and speed up companies’ Digital Supply Chains.Adam.ai Inc, United StatesAdam.ai is a B2B SaaS Meeting Management platform that allows you to capture, manage, and share knowledge in meetings in the most efficient and seamless way, ensuring effective communication, improved planning and better decision making.Workee, United StatesWorkee is creating the Future of Work for freelancers worldwide. They build business for freelancers, helping to scale and autopilot their business routing as bookings, payments, client and work management out of the box with 0% fees.PixelFree Studio, inc., United StatesPixelFree Studio automates web and app creation. Design to Code in one Step — Accelerating front-end development From Months to Minutes.FlashCloud Intelligence, United StatesFlashCloud Intelligence is a cutting-edge Go-to-Market Intelligence company that empowers revenue teams to enhance their efficiency in identifying and engaging with their ideal customer profiles. Their comprehensive solutions integrate sales intelligence and engagement capabilities into a unified interface, enabling revenue teams to streamline their processes and focus on driving better results.Treblle, CroatiaTreblle is a lightweight SDK that helps Engineering and Product teams build, ship &amp; maintain REST based APIs faster. It empowers engineering teams and API Product Managers by making their APIs easy to understand. Instead of piecing together data from 3 or more different tools, all the data you need is ready and baked for your consumption and data-driven decision making.Agtools Inc, United StatesAgtools provides First Mile MARKET data across the globe of over 500 commodities in real time for farmers, buyers, and others on the food supply chain to execute better planting, harvesting, forecasting, improving financial outcomes, lower risks, and lower CO2 impact.UNCHAINEDINC LLC, United StatesFuture of work solution that combines the power of people and technology to strategically connect companies with high potential, diverse talent.Top 31 SaaS Startups to Watch at Global 2023 was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/top-31-saas-startups-to-watch-at-global-2023-80320b5124ff?source=rss-a81d7d77d923------2","pubDate":"Thu, 30 Mar 2023 22:11:14 GMT"},{"title":"Top 17 Fintech Startups to Watch at Global 2023","description":"No Description","content":"Fintech is rapidly transforming the way we manage our money and do business. With the rise of mobile banking, digital payments, and blockchain technology, the fintech industry is poised for explosive growth in the years ahead.At this year’s Global Conference, we’re thrilled to showcase some of the most innovative fintech startups in the industry. These companies are leveraging the latest technological advances to create groundbreaking solutions that make managing our finances, investing our money, and accessing financial services easier than ever.These startups are at the forefront of the fintech revolution, from mobile banking apps to blockchain-based payment platforms. Their technologies are poised to transform the industry in countless ways. Whether you’re a financial professional, an entrepreneur, or simply interested in the future of finance, you won’t want to miss these top fintech startups that will be exhibiting at our conference this year.In this article, you can take a closer look at the top 17 Fintech startups exhibiting live in Silicon Valley on April 11–12th. If you haven’t got your tickets yet, you can still secure your spot here.Wallife, ItalyWallife is an insurance MGA committed to insure new risks generated by technology. Their first policy on the market is the Wallife Biometric ID, an insurance for individuals to protect the smartphone from the cyber risks, including theft of biometric credentials, phishing, malware. The policy is combined with a proprietary technology that analyse the usage of your phone to detect potential digital violations.YPay Financial Services (Pvt. Ltd.), PakistanYPay Financial Services aims to achieve a financially stable Pakistan, by creating easy investment opportunities for everyone. It also aims to provide an autopilot investment platform for millennial investors across the nation.PAYTOTA , UgandaPaytota makes payments and payouts equally effortless, helping you to process them in the most stable and cost-efficient way. They offer a flexible, highly scalable, and cost-effective infrastructure to provide merchant services for online businesses of any size and type.Chaperone Limited, LesothoChaperone is a Technological Company and issuer of Electronic Payment Instruments through its platforms. They are partnering with global and local brands to bring about financial inclusion in Africa. With the help of their bespoke fintech solutions, they are supporting companies to fully digitise their payment processing.Planworth, CanadaPlanworth is a cutting edge B2B SaaS platform for investment advisors and professionals who want to be the trusted guide at every step of a client’s wealth journey. It combines easy-to-use questionnaires and advanced data analytics to put the experience and expertise of a virtual family office at the fingertips of investment advisors and professionals.INSTO, TaiwanINSTO Tap is the Skype for credit card payments. Anyone can take credit card payments with just a free app. It is focusing on using innovative technology to bring inclusive financial services such as cash flow collection and installment collection and payment into mobile apps.SPARE, United StatesIt is software that empowers local communities to create localised financial services.Small businesses and underbanked consumers have seen rising costs associated with accessing cash. SPARE reduces the merchant expense by up to 75% while eliminating the cost for consumers via their SaaS + Gig Econ model. Retail SMBs pay a monthly fee while consumers are incentivised by bonus cash up to 2% when picking up cash.Bytese, SingaporeXTsunami represents a group of radically different Web3 trading applications for stocks (Share CFDs) and crypto (Crypto Futures), with a forex trading software coming soon. XTsunami is based on XTblock’s revolutionary core technology, which powers real-time price action analysis &amp; trading tools that provide traders with highly valuable data to enable high-quality trading decisions — unlike any other trading softwares currently available.Ten Key Labs, CanadaTen Key Labs is combining experience and expertise to bring emerging technologies to industries at scale.They are creating a trusted and transparent operating system for businesses. It’s team consists of a group of technologists, led by serial founders, who have worked together for over a decade (mobile, enterprise, vehicle connectivity), and now tackling blockchain.Quantum Electronic Payments LLC, United StatesQuantum is a financial technology company that helps businesses of all types and sizes accept payments, increase revenue, and enhance customer experience. With flexible omnichannel solutions, Quantum delivers end-to-end Payments and Growth Technologies that accelerate profits and efficiencies for retail, ecommerce, B2B, and service organizations. Infused with an unyielding commitment to providing industry-leading Customer Care, It is a trusted, vital, easy-to-work-with partner for thousands of businessesMerlin Investor, United StatesMerlin investors is a Fintech company on a mission to democratize access to investment strategies and empower the new generation of retail investors to take full control of their investments. They offer a multi-asset educational, strategising and tracking tool complementary to any trading platform and designed for any kind of retail investor. The Merlin platform is a multi-asset educational, strategising and tracking tool for personal investment strategies, It is complementary to any trading platform and designed for any kind of retail investor.Datatrixs, United StatesDatatrixs transforms accountants from data crunchers to automation experts with a few clicks when serving clients. For accounting firms, Datatrixs is your one central hub to automate the generation of analytical reviews, collaborate, and improve margins. It provides automation to improve margins for accounting firmsDojah Inc, NigeriaDojah is an end-to-end Identity verification and fraud prevention platform. It is on a mission to build Africa’s most robust platform for simple, smart, accessible identity and verification solutions.GIG-A, JapanGIG-A is facilitating fully mobile, 100% digital bank accounts in Japan, providing multilingual service and support. They are focusing on financial inclusion and believe that opening a bank account in Japan should take only a few minutes on your mobile. Banking services must be easy to use and everybody should be able to access the full potential of financial services.Vesti Technology Solutions, United StatesVesti is a global migration fintech company with the vision to simplify mobility of humans and capital. Their mission is to be the go-to provider of legal and financial technology to people intending to migrate, and give them access to financial services like debit cards and bank accounts when they have newly arrived in a new country.PayQin, United StatesPayQin is a Cross-border payment app for francophone Africa. It is a payment solution which enables Individuals and businesses in Francophone Africa to safely and securely pay, transfer, and trade from a single mobile app. It is the only company in Francophone Africa that enables instant cross border transfer — within 7 Francophone countries.Flex Finance, United StatesFlex Finance is an Intuitive spend management solution helping hundreds of thousands of underserved businesses in Africa digitize their over $1.6 trillion annual B2B spending. It helps businesses in Africa manage approval workflow, vendor payments, issuing corporate cards to employees, and making disbursements from one platform.Top 17 Fintech Startups to Watch at Global 2023 was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/top-17-fintech-startups-to-watch-at-global-2023-dc56d1e118d9?source=rss-a81d7d77d923------2","pubDate":"Tue, 28 Mar 2023 18:01:50 GMT"},{"title":"Top 17 AI Startups Exhibiting at Global 2023","description":"No Description","content":"Artificial intelligence is transforming the way we live and work, and the potential for innovation in this field is limitless. As the world becomes more data-driven and interconnected, AI startups are poised to disrupt industries and revolutionize how we interact with technology.This year’s Global Conference Startup Exhibition is proud to showcase some of the most promising AI startups worldwide, whose cutting-edge technologies are pushing the boundaries of what’s possible. From natural language processing to computer vision and beyond, these companies are leveraging the power of AI to solve some of the world’s most pressing problems and improve our everyday lives.Below, you can take a closer look at the top 17 AI startups exhibiting live in Silicon Valley on April 11–12th. If you haven’t got your tickets yet, you can still secure your spot here.Cyberfilm.ai, United StatesCyberfilm builds and sells SaaS tools for filmmakers, powered by Generative AI like GPT and DALL-E. They make tools for the next generation of creatives, powered by AI and Big Data from Hollywood.YesPlz, United StatesYesPlz makes search and discovery easy for eCommerce businesses. They connect tagging data to pre-built product filters, enhanced site search, and product recommendations so any eCommerce business can easily access highly accurate search and recommendations. Their machine learning is highly optimized to automate deep product tagging which used to be done manually by retailers. No more paying 3–4 times to separate vendors and getting stuck managing different software integrations. Instead, eCommerce businesses can access the latest product discovery solutions powered by AI at 1/4 the cost.R3A Group Limited (CL1CK), ChinaCL1CK helps e-commerce websites pick the best discount to offer to visitors and make sure that visitors get a discount that will make them most likely to buy something. It’s tough for ecommerce stores to compete, get people to buy stuff, and keep them coming back. That’s where they come in by using data to figure out which discounts will work best for shoppers. With CL1CK’s AI, e-commerce websites can give alternating discounts that actually work and easily assess how well they’re contributing to revenue.AI Writer Technologies FZ-LLC, United Arab EmiratesAI-Writer generates accurate and unique article drafts just from a headline. Through this, you can get quality content at lightning speed with the most accurate algorithm trained on hundreds of thousands of source articles.Contents.com, ItalyIt is a generative AI SaaS Platform that offers automated content creation tools to support any business with their daily content needs. This solution covers the whole content workflow, from ideation, through creation, to transformation. Their strategy strongly relies on the choice of specializing in minor languages with their own data sets for high quality fine tuning.OTIS AI, United StatesOtis AI is the ultimate paid ad and media buying platform in a box for startups and SMBs, integrating with first party data to facilitate data-driven targeting and attribution. Their digital marketing app would eliminate some of the pain points that business owners encounter when they try to run their own campaign or work with a marketing agency.PONS.ai, ChinaPONS.ai is an AI-generative digital collectibles platform for phygital marketing and gaming. Launched in Oct 2021, customers now include top-tier banks, NASDAQ-listed tech companies, galleries and many more across industries.Convofind, United StatesConvofind uses AI/ML to connect you on-demand with the best possible person when you want to discuss anything. They are creating a more seamless conversational experience, using AI to connect you with the right people when you have a topic, thought, question, or need you want to discuss.Ace (Yoda Coach Inc.), United StatesAce analyzes working data from GitLab, Slack, Jira, etc., to empower 1M engineering managers with actionable insights to drive performance, motivation, and growth of 50M developers. You can get an agenda for 1:1 meetings, mentors, courses, goals, feedback recommendations.They empower managers and developers to achieve extraordinary results by eliminating bias and unlocking developers’ potential.Expand AI Pvt Ltd., IndiaExpand AI has built a machine learning software that can programmatically label your data with high accuracy in hours instead of weeks with an economical pricing. Their automated data labeling solution is domain-specific and can generate labels that are &gt;95% accurate.Their mission is to make the training phase of the machine learning lifecycle smoother by programmatically generating highly accurate labels in hours at a low price.Analytics2Go, United StatesAnalytics2Go offers an end-to-end AI platform for enterprise-level companies and SMBs. Their focus is using AI to optimize demand prediction and price optimization for online retail, CPG and wholesale distributor companies. They have also solved the considerable challenge of managing data streams to feed real-time AI solutions with our automated data orchestration solution called Felix.Selecton Technologies Inc, United StatesSelecton Technologies is a Generative AI startup developing technologies to enhance human decision-making and buying experiences. Our core tech includes customized LLMs, proprietary unique RL models, and human understanding tech. It is the first AI-based personal assistant that finds а perfect purchasing solution to fit any customer situation.EQUITY X LTD., United KingdomEQUITY-X® helps individual equity traders better predict upward or downward trends in the short term and find signals in a faster manner by themselves; share price is likely to increase (decrease) when cash flows increase (decrease) in the medium and long term. It offers daily executive summaries and historical fundamental analysis data.Lincode Labs, United StatesLincode has developed a unique computer vision-based solution that detects QA issues at higher rates of accuracy and at lower costs than major competitors. The Secret? A proprietary model that incorporates AI to detect manufacturing defects of less than 2 microns at 120 FPS, incorporates ML to predict machine downtime, and incorporates AI and ML to predict the likelihood of future product defects. The solution is deployable with basic camera equipment in open environments and is operable within a single month of engagement.CognitivEdge.ai, United StatesCognitivEdge.ai — Simple, &amp; Powerful Edge AI apps &amp; Analytics. Industry-first data-centric, &amp; data-driven AI/ML and Deep learning applications are on the edge in hours, not days or months. Accelerating AI deployment, deployment, prediction, and resolution at blazing speed benefits you from real-time processing, insights, and actions. Saving time, and costs.One Connect Solutions, United StatesOne connect solutions helps organizations get insights from free flowing text and data without the need to hire data engineers or data scientists. They enable our customers to easily adopt AI &amp; ML and get business value.Quasi Robotics, United StatesQuasi Robotics is helping humans to alleviate all boring, repetitive and dangerous tasks through robots. Driven by their passion for technology and instinct for innovation, they aim to bring smart, safe, reliable machines to every business in the world.Want to exhibit your startup in Silicon Valley and gain exposure like this, pitch to investors, and get access to all the other benefits? Apply here.Top 17 AI Startups Exhibiting at Global 2023 was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/top-17-ai-startups-exhibiting-at-global-2023-a4b52edbf8eb?source=rss-a81d7d77d923------2","pubDate":"Tue, 14 Mar 2023 23:10:44 GMT"},{"title":"40 Startups to Watch at The Upside of Downturns Summit","description":"No Description","content":"The Upside of Downturns Summit will bring together thousands of startup teams on October 20th to talk about fundraising, leadership, and resilience in today’s economic climate. A highlight of this event’s virtual program is the Accelerate Exhibition — where 40 of the top companies from Startup Grind’s community will pitch and exhibit for the entire audience. We’re sharing a sneak peek into each of the exhibitors today, but make sure to register for the event (it’s free) and visit their virtual booths in just a few weeks.Activated Scale, United StatesIndustry: Marketing / Advertising / Sales📣 Find them at booth #1Activated Scale is a marketplace that connects start-up founders with sellers. Connect with pre-vetted US-based sellers that have prior experience selling to your buyer or industry. Hire them part-time or full-time and convert the best to employees!Activity Savant, United StatesIndustry: Community📣 Find them at booth #2Activity Savant helps community-based organizations create and manage activities and fundraisers. It also links together organizations, businesses, and resources together. Additionally, they provide small underserved, and under-resourced communities with tools to engage with the population and also provide health and human services.ASKNIGHTS, United KingdomIndustry: Consumer Goods / Services📣 Find them at booth #3ASKNIGHTS is the most selective and curated Art Marketplace with remarkable contemporary art pieces, futuristic top NFT Art &amp; highly curated Crypto Art. They are launching their newest project, which is focused on developing the best and most efficient international platform for the art industry and a global art marketplace. It uses the latest emerging technologies such as NFTs on blockchain and smart contracts for better security, accountability, trust, and transparency.Biohackn, United Arab EmiratesIndustry: Biotechnology📣 Find them at booth #4Biohackn is a Dubai-based Anti-aging and health company that uses ancestral wisdom and modern science to deliver products that help reverse aging, bringing back that boundless energy, peak performance state and improving overall health. They are committed to providing you with science-backed hacks that you can use every day to enhance your quality of life.Brickken, SpainIndustry: Blockchain/Crowdfunding📣 Find them at booth #5Brickken is a decentralized protocol whose objective is to bring companies’ capital on-chain through the tokenization process. Companies on the blockchain have the ability to manage their equity more efficiently and, in addition, issue Security Token Offerings as a crowdfunding mechanism for their own capital or for any assets they have or want to acquire, without the need for intermediaries.Buzzup, ItalyIndustry: Agriculture📣 Find them at booth #6BuzzUp creates IoT devices that listen to and translate the sound of bees into pollination performance and health data to help farmers increase crop yields, beekeepers increase profits, and help save bees in an increasingly difficult climate.Dovetail Electric Aviation, AustraliaIndustry: Airlines/Aviation📣 Find them at booth #7Dovetail Electric Aviation is leading regional aviation into an exciting new, sustainable era with nil emission, electric-powered aircraft. It is at the forefront of developing, certifying, and distributing electric-powered, nil emission propulsion systems for existing commuter aircraft — converting legacy aircraft into electric aircraft. Aside from zero-emission flights, the benefits to the operator include significantly lower adoption costs, energy costs, and maintenance costs.Dropstat, United StatesIndustry: Health Care📣 Find them at booth #8Dropstat uses proprietary algorithms to help enterprise healthcare facilities fill shifts faster while cutting down on agency and overtime costs. It is a nurse-founded company leveraging technology to ensure safe patient care despite staffing shortages and volatile costs.DuploCloud, United StatesIndustry: Software Development📣 Find them at booth #9DuploCoud is a no-code infrastructure automation software. Provisioning applications 10x faster. It offers an end-to-end DevOps software platform for dev teams without dedicated DevOps engineers and augments those who do. The platform automates the provisioning of your application to the cloud (AWS, GCP, Azure), integrating cloud ops, DevOps, and security/compliance with 24x7 monitoring and support. The software runs in your cloud account and is accessed through our UI, Terraform, or API.Educate Online, United StatesIndustry: Education📣 Find them at booth #10Educate Online is a platform for engaging students of all ages in online K-12 study, ESOL, career exploration, university preparation, and internship &amp; mentorship programs. It offers students the three top curriculums in the world: the UK, US, and Canada. Students may choose to study part-time or full-time and have the opportunity to earn their high school qualifications through Pearson Edexcel &amp; Cambridge International or graduate with a US or Canada high school diploma.Feazy.io, GeorgiaIndustry: Education📣 Find them at booth #11Feazy is a SaaS platform for small and medium-sized academies to scale their business faster and easier. It helps you manage your student profiles through a comprehensive dashboard about payment dues, reminders, course subscription analytics, and much more.FLOELLE INC, United StatesIndustry: Health Care📣 Find them at booth #12Floelle, Inc. was co-founded with the mission to develop a medical device that will manage and treat women with urinary incontinence by liberating them from using sanitary paper products. Their vision is to make this device available to all women worldwide, and its patented disposable device will block 500 million incontinent women’s urine leaks &amp; generate $414MM of revenue.GoCoach, United StatesIndustry: Education📣 Find them at booth #13GoCoach is a B2B SaaS Subscription Talent Development Platform that upskills and reskills all employees with a coach marketplace and learning experience platform. They use scalable technology and blended learning to help your employees develop the skills they need to succeed with tailored, relevant, high-quality learning experiences.Helppo Inc, ChinaIndustry: SaaS📣 Find them at booth #14Advances in technology have brought unprecedented changes to life. The recently established 24/7 online learning platform “Helppo” breaks through the time and geographic scope of traditional learning. Through real-time online video teaching, students can follow up on their own learning anytime and anywhere, get individual guidance from the tutor, and conduct interactive academic discussions. Most tutors are from overseas, and some are appointed or graduated from top universities. The field of study is very wide, including English, mathematics, economics, calculus, and public examinations.iBrainy, IsraelIndustry: Education📣 Find them at booth #15iBrainy is an app and platform empowering older adults to learn, connect and feel relevant again through artificial intelligence (AI), accessible and educational quiz games, courses &amp; community features. In your personal dashboard, you can see all your achievements &amp; scores. You also find their suggestion that is personal for you, based on your preferences and needs.iCodejr.com, United Arab EmiratesIndustry: Education📣 Find them at booth #16iCodejr.com is an online coding academy. They offer live online coding classes for students from Grade 1–12 with a world-class STEAM curriculum. iCodejr’s after-school classes help students gain a competitive advantage in computer science and complement their in-school curriculum. It helps them build efficiency in game design &amp; development, app design &amp; development, web design &amp; development, and data science &amp; ML.Jelloow, United StatesIndustry: Marketing / Advertising / Sales📣 Find them at booth #17Jelloow is a cloud-based web application where startups or any growing company can match with qualified marketing agencies to get support for their digital marketing/growth needs. The platform creates liberty for both startups and digital marketing agencies to do business together on a common platform. Jelloow has been successful in creating an ecosystem and focuses on generating revenue by subscribed agencies.Kimby, United StatesIndustry: Fintech / Finance📣 Find them at booth #18Kimby is a platform to invest in one-of-a-kind precious gemstones for investors worldwide. Time and again, precious gemstones have shown to be an alternative asset class that provides a hedge for long-term investors and risk-adjusted returns. However, the alternative asset class is commonly compared to private bonds or real-estate verticals. Investors struggle to enter this investment category efficiently due to the industry’s lack of transparency and expensive entry barriers. Hence, Kimby developed a private investment platform for accredited investors seeking alternative investments in collectibles such as precious gemstones.Lets Join In Pty Ltd, AustraliaIndustry: SaaS📣 Find them at booth #19Lets Join In is the first Social Engagement Platform that generates conversations between organizations and their intended audience. The application allows organizations to have two-way communication with audiences on hot topics, curated content, and news articles using video, audio, and instant messaging. Organizations can utilize their technology to maximize engagement whilst also gathering real-time data and analytics from user feedback.Mauisoft Enterprises, HondurasIndustry: Information Technology / Services📣 Find them at booth #20Mauisoft Enterprises empowers youth in Latin America and give the business world lean ambassadors with the tech and business skills granted at their free-online training center.Maxwell, United StatesIndustry: Human Resources📣 Find them at booth #21Maxwell is a work/life benefits platform that helps teams crush it at work and home. It makes it easy for employees to get the meaningful and personalized support they need from their employers, and in return, employers get engaged teams that can crush it at work and home. A single platform for lifestyle benefits, traditional benefits, employee wellbeing, rewards, and engagement. Keep your teams productive and cared for, while reducing costs and HR’s administrative work.Metasonixx ltd, United KingdomIndustry: Manufacturing / Industrial Find them at booth #22Metasonixx engineers materials that give unprecedented control over sound and noise. It delivers solutions based on standard materials (e.g. metal, plastic, wood, paper) but re-engineered into “acoustic metamaterials,” giving existing products the ability to shape and bend sound. Their designs take inspiration from devices that shape light — like lenses, holograms, and LCD displays — and give their customers unprecedented control over sound in their own products.Motil, United StatesIndustry: Software Development📣 Find them at booth #23Motil is an all-in-one software solution for the self-employed, side hustlers, and freelancers to manage commission-free payments and receivables, and enables calendar scheduling and client booking/engagement with a referral optimization tool — all from one dashboard on virtually any device. Its mission is to grow and empower local economies by unlocking individuals’ full potential and skills.Next Decentrum Technologies Inc, CanadaIndustry: Blockchain📣 Find them at booth #24Next Decentrum is on a mission to democratize access to art and culture by helping museums reimagine their experience, leverage their physical assets, and capitalize on the endless possibilities of the Metaverse. Next Decentrum’s product, Momentable, allows leading museums and artists to publish art and artifacts as digital collectables to reach new audiences around the world, generate perpetual revenue, and create experiences never before possible that inspire, educate, and bring people together. Next Decentrum provides an end-to-end offering, an advanced creator dashboard, powerful storefront with curated artworks and artifacts, and a safe NFT collecting experience.OTIS AI, United StatesIndustry: Artificial Intelligence📣 Find them at booth #25Otis is a digital marketing app that simplifies the experience for users with powerful AI technology that works in the background to maximize your success with digital marketing. It’s easy to use, portable and empowers the users to create their own campaign anytime. The clear metrics show how well your campaign is doing in real-time.Paiid, CanadaIndustry: Fintech / Finance📣 Find them at booth #26Paiid is an omnichannel payments platform that enables businesses to accept e-commerce and mobile payments from over 100 different payment types across the globe, including card schemes, digital wallets, Buy Now Pay Later, SMS, QR code and digital currencies. They are on a mission to transform every mobile phone on the planet into a payment terminal.Philanthrofi, United StatesIndustry: SaaS📣 Find them at booth #27Philanthrofi is a global platform connecting companies to the impact they aspire to create in the world. Companies can invest or partner with active development, humanitarian, and philanthropic projects implemented by Impact Organizations around the world that align with their strategic investments, business operations, expansion markets, and other ESG &amp; Sustainability goals.Picap, ColombiaIndustry: Logistics / Supply Chain📣 Find them at booth #28Latin America’s $1T logistics market is fragmented and undergoing a massive transformation as eCommerce, and B2B logistics require more technology-enabled offerings. Picap built the biggest fleet of motorcycles in Latin America using a ride-hailing model. They use the technologies that help you control your logistics and fleet’s deliveries.RMI Insights, United StatesIndustry: Fintech / Finance📣 Find them at booth #29RMI Insights automates three-statement financial modeling by allowing their clients — asset managers and lenders — to ingest company financials “as is” and visually project how these companies will perform in the future. They use Machine Learning technology to automate and democratize financial modeling for everyone.Safe Haven, BelgiumIndustry: Blockchain📣 Find them at booth #30Safe Haven is building DeFi solutions for safely managing, storing, and transferring your crypto or other digital assets like NFTs, passwords, pictures, and documents. Its solutions include decentralized inheritance, master node solutions, wallets, and pooling services. With a focus on security, they provide decentralized financial, backup, inheritance, and data transfer products for individual consumers and established organizationsScootRoute, United StatesIndustry: Transportation/Mobility📣 Find them at booth #31ScootRoute is a mobile navigation app for micro-mobility. Combining three different mapping technologies with real-time traffic data, ScootRoute finds the ideal route for every scooter journey. Additionally, constant updates let riders keep pace with fast-changing local regulations and a growing scooter infrastructure. ScootRoute has intelligence on speed limits, bike lanes, parking zones, sidewalk rules, and more.Scytale, IsraelIndustry: Cybersecurity📣 Find them at booth #32Scytale is the global leader in SOC 2 compliance automation, helping security-conscious SaaS companies get compliant and stay compliant. Scytale’s SOC 2 experts offer personalized guidance to streamline compliance, enabling faster growth and boosting customer trust.SkliQ, United StatesIndustry: Technology / Service📣 Find them at booth #33SkliQ is a Human Intelligence Platform as a Service (HIPaaS) for organizations of all sizes where its internal people can find, connect and collaborate with their global colleagues based on their top skills. With this, your organization can engage a global workforce and facilitate collaboration between co-workers across locations.SkyVest, OmanIndustry: Investment Management/Cryptocurrency📣 Find them at booth #34SkyVest is a comprehensive platform to facilitate cryptocurrency trading. Its goal is to be your safe and reliable companion in the complex world of cryptocurrencies and to be able to remove obstacles and difficulties in the path of growth in the digital world. They connect investors to market analysts and build trust between the two groups. It also allows investors to use the experiences of professional traders and strengthens the motivation of professional traders to share their experiences.Startupy. United StatesIndustry: Information Technology / Services📣 Find them at booth #35Startupy matches engineers and entrepreneurs based on rate and project fit. Their easy-to-use platform helps engineers find their dream projects &amp; collaboration opportunities, whereas startups can find people they can afford and have the right skill set. Join a community of developers and entrepreneurs looking for their next big opportunity.The Black Book, United StatesIndustry: Marketing / Advertising / Sales📣 Find them at booth #36The Blackbook is a web extension that connects people to black-owned brands as they shop online. Its mission is to connect black consumers and black businesses in a way that’s easy, meaningful, and helpful. They believe that the platform is an effective way to redirect black dollars back to the community.Virtual Operative Services, South AfricaIndustry: SaaS📣 Find them at booth #37As an entrepreneur or business owner, you are wearing more than one hat, which can be frustrating and exhausting. Virtual Operative Services will take over all the tedious tasks that keep you busy but unproductive. It is a subscription-based Virtual Admin Team Capacity app for Startups, Scale-ups, and SMEs needing internal teams.Vital Start, United StatesIndustry: Health Care📣 Find them at booth #38Vital Start Health is a University of Pennsylvania startup that has developed the first maternal mental health platform using VR for equitable, personalized, clinically guided care for mothers across the maternity continuum from pre-pregnancy/fertility, pregnancy, and postpartum.Zorion, United KingdomIndustry: Fintech / Finance📣 Find them at booth #39Zorion is an innovative, ethical, and socially responsible investment platform that puts equal focus on smart decision-making, ESG concerns, and spirituality. They believe everyone should have the opportunity to increase their Financial well-being through investments. It should be easy, safe, reliable, and ethical. The platform makes it easy to invest in stocks, whether you’re just getting started or already a pro221e srl, ItalyIndustry: Computer Hardware Manufacturing📣 Find them at booth #40221e is a pioneer in wearable sensors that offers knowledge in algorithm modeling, electronic engineering, and design. They surf the wave of IoT and wearable systems, merging advanced hardware designs with intelligent software architectures driven by an approach devoted to continuous improvement, solid engineering skills, curiosity, and passion for data and its science.40 Startups to Watch at The Upside of Downturns Summit was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/40-startups-to-watch-at-the-upside-of-downturns-summit-fbf95343acfe?source=rss-a81d7d77d923------2","pubDate":"Wed, 05 Oct 2022 14:52:09 GMT"},{"title":"Startup Spotlight Q&A: Welivery","description":"No Description","content":"Last-mile delivery is a huge market right now, and amazing startups around the world are working to fill it. Welivery is one of these startups, simplifying delivery for e-commerce providers. Their shipping service is focused on deliveries on the same day for any company or business that sells its products through electronic commerce. We sat down with Welivery’s Chief Marketing Officer Cristina Narváez for a great chat about their company and its many recent successes.In a sentence, what does Welivery do?Provide logistics shipping services to companies.How and when did Welivery come to be?We were started in 2015 by two Argentine electronic engineers and entrepreneurs, Guido Buscetti Castro and Mauricio Boiko. Our founders wanted a better user experience when they ordered products online and we saw that the last mile of service is where we could focus.What makes your company/product different in this market?1. Deliveries flex shipments / same-day shipments. Prices according to the market. API and Plugin integration. Customer service. We make 2 visits to the client’s home at no cost in case it has not been found. We have an easy and fast service to work with (no paperwork or cumbersome processes).2. Our customers want to get more sales. By hiring us, they have better shipments, therefore happy customers, which is compensated in more sales and a better brand reputation.What milestone are you most proud of so far?Our most exciting milestone was opening our second office in another country. From Argentina, we went to Chile, and in Chile, we grew 150% in just 2 months after starting activities.Have you pursued funding and if so, what steps did you take?We consider ourselves a camel startup — we don’t need constant investment to keep growing. Instead, we reinvest our profits to help us grow.What KPIs are you tracking that you think will lead to revenue generation/growth?If our clients grow, we grow with them.How do you build and develop talent?The team has been built little by little, based on the needs that we have detected. We are big on motivating our team.How do you manage growth vs sustainability?Through technology. We developed an app for our drivers and distributors that provides order status, helps create efficient routes, and allows them to save photos to confirm deliveries. It also provides security for drivers and customers.Have you been or are you part of a corporate startup program or accelerator? If so, which ones and what have been the benefits?We have won contests in Argentina and participated twice in Startupchile, once in the Seed G23 program and then in the Growth1 program. We were the only startup that automatically went from the Seed program to the Growth1 program. We were in the program with startups like Betterfly, the first social unicorn in Chile. We are also currently part of Oracle for Startups.Who is your cloud provider?We are multicloud with the most recognized integrations in the market, including Oracle.What’s been the most significant success for the team?Expanding to new countries. We started in Argentina and have since expanded to Chile, Columbia, and now Spain.What are the biggest challenges for the team?The Covid-19 crisis has put the logistics sector to the test, putting maximum pressure on our response capacity. Tripling and even quadrupling operations in a short time without prior planning was a great challenge. This situation has led us to move agilely without neglecting the quality of our services.Training our customer service team was another huge challenge as they need to be able to work with end customers and clients. And finally, making sure we automate as much of the process as possible was critical.What advice would you give to other founders?Focus on customer loyalty.Want your startup to be featured next? Visit our website and apply for the Startup Grind membership today!Startup Spotlight Q&amp;A: Welivery was originally published in Startup Grind on Medium, where people are continuing the conversation by highlighting and responding to this story.","link":"https://medium.com/startup-grind/startup-spotlight-q-a-welivery-c8c4d98ccc3f?source=rss-a81d7d77d923------2","pubDate":"Tue, 02 Aug 2022 18:30:17 GMT"}]
