[
  {
    "title": "The Filecoin Foundation Blog is Moving!",
    "description": "No Description",
    "content": "The Filecoin Foundation blog is migrating to the Filecoin Foundation website!The stories we’ve published to date will remain available here, and will also be available on the new blog. Please visit https://fil.org/blog for our latest updates and announcements.",
    "link": "https://filecoinfoundation.medium.com/the-filecoin-foundation-blog-is-moving-c1d8f74102e5?source=rss-5ae65b323734------2",
    "pubDate": "Wed, 14 Dec 2022 21:11:55 GMT"
  },
  {
    "title": "Social Media on the Decentralized Web",
    "description": "No Description",
    "content": "In recent days, many Twitter users have sought alternative platforms, like the decentralized social media network Mastodon, in the face of controversial layoffs, and leadership and product changes. According to Fortune, since Elon Musk took over Twitter on Oct. 27, Mastodon has drawn 489,003 new users, bringing total monthly active users to more than 1 million.Users have many complaints about the governance of centralized social media issues, ranging from the security of private information to content moderation policies. Most platforms we know and use every day are part of a centralized ecosystem, which gives a small group of companies control over the personal and professional information of the masses.Building a decentralized alternative to these giants requires time and effort: Mastodon, while new to many people, is based on work that stretches back over a decade. And while Mastodon is a worthy match for Twitter’s current feature-set, it’s not enough for these tools to simply match the social media giants. New entrants will need to offer different and unique benefits, like enhanced privacy, security, and stability, that compel users to switch, and embrace new platforms and solutions.At Filecoin Foundation, we see the technologies in the Filecoin ecosystem offering rock-steady stepping stones to this better future. Libp2p lets individual users find and talk to each other, without needing central servers. IPFS gives new services a way to find data, wherever it is stored — freeing them from dependence on one social media company over another and letting users move from one service to another. The Filecoin network itself, with incentivized storage, not only provides a provably stable basis for hosting content, but also shines a light on the kind of incentive systems that will enable independent social media to sustain and provide for itself for the long run, without relying on the largesse of the current tech giants.Here are some organizations leveraging these protocols and others to develop social media tools and networks:SpritelyThe Spritely Networked Communities Institute was established to “put people in control of their own identity and build the technology that would enable a shift to collaborative and intentional security models prioritizing active consent.” Founded by Randy Farmer and Christine Lemmer-Webber, two pioneers in the space of open protocols for social software, Spritely is working on free, open-source software for developers to create a system devoid of gatekeepers and centralized data collection.Spritely’s fundamental research will provide four important benefits to future decentralized social media. It will:Furnish a secure object capability network suite, which enables object-to-object communication.Enable a peer-to-peer interface for social software instead of client-to-server, with no gatekeepers required, which will be able to interconnect with existing peer-to-peer technologies such as libp2p and Tor Onion Services.Support granular and revocable trust that is persona-specific, with local human-meaningful mapping to decentralized identifiers, allowing discoverable names across networks, and credential management.Offer a suite of distributed debugging tools that allow for time-traveling to the state of the system when the error occurred.Filecoin Foundation for the Decentralized Web (FFDW) recently announced an award to Spritely to further efforts to give people autonomy over identity and their relationships online.AudiusUser-generated content boomed during the Web 2.0 era. Audius is a music streaming platform based on modern decentralized technologies, which puts creators directly in contact with listeners and in control of their own products.In today’s world, centralized music platforms offer little to no transparency on pay, publishing rights, licensing, and other serious issues. We’ve seen the backlash that the most popular platforms today have faced over their payment structure — or lack thereof. The Audius API lets streamers and listeners determine the payment structure and redefines the concept of monetization on social platforms: Artists earn compensation each time they post content, and listeners earn by completing tasks such as streaming streaks and offering feedback. Plus, a recent integration with TikTok means that Audius creators can provide their music to TikTokers looking for a background track for their videos.From Audius’ beginnings in 2018, it has used IPFS as a decentralized system for storage without up-front payment or lock-ins. Today, Audius is both a protocol and a platform built on top of several blockchain and community-run nodes. Audius is open source, open data and access, and open ownership.Freenet 2Freenet 2 is modernizing the concepts originally developed by Freenet, software that empowers anonymous chatting, file sharing, browsing, and website publishing, pages known as “freesites.” Freenet users contribute a portion of their hard drive and storage bandwidth, creating a decentralized ecosystem that is far less susceptible to malware and other malicious cyberattacks.Last year, Filecoin Foundation awarded a developer grant to Freenet to help provide support for libp2p into Freenet 2, the project’s new foundation for decentralized, sealable social networking.And a few more:Gummys — A community-powered streaming platform allowing users to generate income by creating, minting, and trading tokenized media content, watching videos, and more. Learn more about Gummys work building on the Filecoin network.Quest Chains — A gamified learning onboarding platform which rewards users through questing. Quest makers create quest chains, while questers would then complete the quests and get rewarded with NFTs, which would showcase their newly acquired skills in profiles. Learn more about Quest Chains building on the Filecoin network.Volaverse — Creating a community-driven metaverse around the globe and building a learning, teaching, and socializing platform creating a gamified and immersive experience for users. Learn more about Volaverse building on the Filecoin network.These are just a few of the many companies and non-profits creating an alternative to centralized internet platforms. Everything we do today happens online, and the data from almost every interaction we have is stored on a server somewhere. A decentralized web enables users to take back control of their information and know exactly what is happening to our most sensitive information.Learn more about FF and FFDW GrantsThe Filecoin Dev Grants program helps advance projects and aims to award additional grants to boost development in the ecosystem. Check out other grant recipients and learn how you can apply for open grants and Microgrants.Find out more about FFDW’s grants program.",
    "link": "https://filecoinfoundation.medium.com/social-media-on-the-decentralized-web-c2b318adc3fb?source=rss-5ae65b323734------2",
    "pubDate": "Tue, 15 Nov 2022 17:49:32 GMT"
  },
  {
    "title": "New Survey: American Consumers Are Ready to Change Up to Web3",
    "description": "No Description",
    "content": "The results of a new survey of American consumers from the Filecoin Foundation reveal that — while Americans trust the internet’s overall resilience, they don’t like how their data is managed by the current gatekeepers. In the survey results, they speak of precious memories lost online, worry about losing control of their personal information, and that they see the benefits of a decentralized internet. The survey provides insights into Americans’ perceptions of and experience with digital storage, today’s centralized web and decentralized alternatives — including Web3 technologies such as NFTs, metaverse, and cryptocurrencies.The survey of over 1,000 American adults found that only 22% think that the internet is extremely or very fragile, yet over half (55%) indicate that they have lost digital information that they cared about.Additionally, the findings indicate widespread data loss and lack of control over data. A majority of Americans (71%) have lost information/records due to link rot. Plus, 42% of Americans have been locked out of an account, 33% of Americans have lost photos they could never get back, 32% have been unable to access old email accounts, and 25% have lost data.Americans don’t feel in control of their own data:83% of Americans want technology companies to do more to enable them the ability to control how their personal information is used.Over three-quarters (76%) try to share as little personal information or data as possible online to have more control of their data.65% do not feel in control of how the information they share with websites and companies is used.61% feel they have lost control of what happens to their personal information online.In a future world where Americans could experience the internet differently, they would like the ability to:Safely store information (61%).Choose exactly what information they share with others online (58%).Choose exactly how long others can keep their information (50%).Report problems, make fixes, and create new tools that make the internet better for everyone (44%).Experience fewer disruptions caused by outages or platforms being down (42%).Americans are open to alternative methods for storing and accessing their data:Filecoin Foundation’s survey also revealed an openness among Americans for an alternative method for storing and accessing their information. The vast majority of Americans (85%) believe it is important that we preserve our most important information for future generations, and 73% think it’s important to preserve historical stories, evidence, and data, in addition to works of literature (62%), public government data (61%), human rights information (60%) and academic studies/research (59%). Americans want to have a place to safely store information, choose who has access and for how long, have the control and option to monetize their data, and have the choice to rely on more companies instead of a select few.The findings underscore the need for a decentralized alternative to big tech that puts people in control of their own data, protects user privacy and security, and permanently preserves humanity’s most important information.MethodologyOn behalf of Ground Control Research, a leading opinion research firm, collected 1,005 responses from a representative sample of online American adults using Rep Data. The survey was conducted in August 2022. Population calculations were made using the 2021 U.S. Census Population &amp; Household Estimates.",
    "link": "https://filecoinfoundation.medium.com/new-survey-american-consumers-are-ready-to-change-up-to-web3-a8bc1cb48155?source=rss-5ae65b323734------2",
    "pubDate": "Tue, 01 Nov 2022 16:11:43 GMT"
  },
  {
    "title": "Filecoin Foundation and FFDW Team Up with the Internet Archive to Preserve Government Datasets in…",
    "description": "No Description",
    "content": "Filecoin Foundation and FFDW Team Up with the Internet Archive to Preserve Government Datasets in New ‘Democracy’s Library’ InitiativeFilecoin Foundation and Filecoin Foundation for the Decentralized Web (FFDW) have announced that they will be teaming up with the Internet Archive to support the Archive’s new Democracy’s Library project. This initiative will create a free, open collection of government data that will ensure that government research and publications from around the world remain permanently accessible to the public.The Internet Archive has spent the past 26 years building the world’s largest digital library. Democracy’s Library is an extension of that effort, and the Archive has committed to working with government agencies, libraries, and universities to preserve government data online.This week in San Francisco, Marta Belcher, president and chair of Filecoin Foundation and FFDW, took the stage with Brewster Kahle, founder of the Internet Archive, to discuss the vision for Democracy’s Library and how decentralized technologies can ensure that collections of government data are preserved into the future and accessible to everyone.Working hand-in-hand with the Internet Archive, the Filecoin Foundation and FFDW will help to store these collections on decentralized technologies like the Filecoin network to ensure robust and secure long-term preservation, in line with the Foundation’s mission to preserve humanity’s most important information. This builds on the Filecoin Foundation’s other work with the Internet Archive.“Today, books, newspapers, research, and more sit behind paywalls. Our dominant information ecosystem is one of scarcity — it’s time to rethink that, especially when it comes to public data,” said Brewster Kahle, founder of the Internet Archive. “Governments spend exorbitant amounts of taxpayer dollars to publish documents and educate their citizens, but this information is not always accessible. Democracy’s Library is a vision — to bring that ongoing investment from governments around the world to the internet generation. It will leverage technology to build an information ecosystem of abundance — where information can be uncovered, unlocked, and reused in new and different ways. This is a stepping stone to citizens who are more empowered and more engaged.”The first initiative between Filecoin Foundation, FFDW, and the Internet Archive to advance the Democracy’s Library project will focus on the collection, preservation, and accessibility of U.S. and Canadian government documents in partnership with the Internet Archive Canada.This collaboration dovetails with Filecoin Foundation’s Public Data Commons initiative, a program focused on making storage for government datasets across the globe more resilient, permanent, and cost-effective using the Filecoin network“On today’s internet, data is stored by just a few intermediaries, making our data vulnerable to single points of failure,” said Marta Belcher, chair and president of Filecoin Foundation and FFDW. “The decentralized web offers an alternative in which the availability of information is not dependent on one company or server. This provides a more robust and resilient platform for humanity’s most important information, including precious government datasets that belong in the hands of the public. We are delighted to support the Internet Archive’s efforts to build Democracy’s Library to ensure free, open access to government datasets for all.”",
    "link": "https://filecoinfoundation.medium.com/filecoin-foundation-and-ffdw-team-up-with-the-internet-archive-to-preserve-government-datasets-in-a7508aade531?source=rss-5ae65b323734------2",
    "pubDate": "Thu, 20 Oct 2022 13:01:45 GMT"
  },
  {
    "title": "Filecoin Foundation Introduces FIL Lisbon 2022 to Bring the Web3 Community Together, Announces…",
    "description": "No Description",
    "content": "Filecoin Foundation Introduces FIL Lisbon 2022 to Bring the Web3 Community Together, Announces SpeakersWeek-long event welcomes 50+speakers to explore FVM, sustainability, NFTs, the metaverse, Web3 and more through the perspective of the Filecoin communityOCTOBER 17, 2022 — Filecoin Foundation — an independent organization that facilitates governance of the Filecoin network, funds critical development projects, supports the growth of the Filecoin ecosystem, and advocates for Filecoin and the decentralized web — unveils the details of FIL Lisbon, the first major gathering of the Filecoin community in Lisbon, Portugal, taking place October 30 — November 4.The six-day event will feature over 50 industry-leading speakers and will convene builders, developers, storage providers, ecosystem partners, clients, and investors from across Web3 and the Filecoin ecosystem. FIL Lisbon is bringing the community together for workshops, hackathons, panels, meetups, networking, happy hours and more in one of the world’s preeminent cities for blockchain technology.FIL Lisbon Main Stage Days will take place at the LX Factory on October 31 and November 1. We’re welcoming top speakers from around the Web3 ecosystem to the FIL Lisbon stage to discuss the most pertinent issues affecting the Filecoin ecosystem today, including:Juan Benet, CEO and Founder, Protocol LabsMarta Belcher, President and Chair, Filecoin FoundationIllia Polosukhin, Co-Founder, NEARKristin Smith, Executive Director, Blockchain AssociationJonathan Dotan, Founding Director, Starling LabKurt Opsahl, Deputy Executive Director and General Counsel, Electronic Frontier FoundationAngie Lau, CEO and Founder, Forkast NewsMichael Morisy, Chief Executive Officer, MuckRockJeff Bandman, COO and GC, 6529 GroupEugenia Filippova, Segment Lead, EverstakeMore speakers to be announced“The Filecoin ecosystem has seen tremendous growth this year. The amount of client data onboarded to the network has increased 9x to over 230 PiB in 2022 and is growing ~25% month over month. Clients storing data to Filecoin include traditional Web2 institutions with large datasets and growing Web3 applications, such as web3.storage, which now stores 140M uploads from 80K+ users,” said Colin Evran, Ecosystem Lead at Protocol Labs. “FIL Lisbon provides this engaged and growing community an opportunity to connect, learn, and share ideas on how to bring more startups and use cases to the world’s largest decentralized network. We look forward to seeing everyone there.”Amidst hackathons and meetups, FIL Lisbon includes the following events:October 30 — The Filecoin Interplanetary Party: Kick off FIL Lisbon with the Filecoin community and celebrate two years since Filecoin mainnet launch.October 31 — November 1 — Main Stage Days: The two-day Main Stage programming will include insightful talks from top-notch speakers and panel discussions from the world’s foremost Filecoin ecosystem participants. Additionally, we’re hosting interactive workshops with Web3 builders, who will take attendees through the Filecoin roadmap, world of Filecoin Virtual Machine (FVM), NFTs, sustainability, updates from the storage provider ecosystem, the metaverse, and beyond.Additionally, from October 24 — November 4, Filecoin Foundation is hosting a hacker base with Fission Codes and Lightshift. It will be a place for co-working, workshops, and lightning talks throughout the week.“The Filecoin Foundation is so thrilled to be bringing together the Filecoin community in Lisbon, two years after Filecoin mainnet launch, following a year of tremendous network growth,” says Marta Belcher, President and Chair of Filecoin Foundation.FIL Lisbon is open to everyone and provides a unique opportunity for people within and outside of the blockchain industry to learn, build, connect, and venture into the exciting prospects of the future of Web3. You can register for the FIL Lisbon kickoff party and Main Stage days here. For more information about the event, visit https://fil-lisbon.io/About Filecoin FoundationFilecoin is a decentralized storage network designed to store humanity’s most important information. Filecoin Foundation (FF) facilitates governance of the Filecoin network, supports the Filecoin community, grows the Filecoin ecosystem, funds research and development, and advocates for the broader decentralized web.",
    "link": "https://filecoinfoundation.medium.com/filecoin-foundation-introduces-fil-lisbon-2022-to-bring-the-web3-community-together-announces-a06c9d70b78d?source=rss-5ae65b323734------2",
    "pubDate": "Mon, 17 Oct 2022 17:52:12 GMT"
  },
  {
    "title": "Case Study: Seal Storage Making Web3 Accessible for All Through Ecosystem Leadership and the…",
    "description": "No Description",
    "content": "Case Study: Seal Storage Making Web3 Accessible for All Through Ecosystem Leadership and the Filecoin NetworkKey Highlights:Seal Storage is a data platform that aims to make Web3 accessible for all by providing sustainable, immutable, and affordable Web3 cloud storage.As one of the earliest providers on the Filecoin network, Seal Storage is an established leader in the ecosystem. The company is a top storage provider in North America, with over 20PB of capacity across the U.S. and Canada, and is looking to add over 100PiBs more.Seal Storage currently serves universities, research institutes, enterprises, and other firms to store their data in a more sustainable, affordable, and immutable way.Read the full Seal Storage Case StudyProviding an alternative data storage solutionThe use of cloud infrastructure services has spiked over the past few years, since companies around the world were forced to digitize their businesses during the pandemic. In Q4 2021, spending on these services grew by 13.5% YoY to an average of $21.1 billion, and tech research firm IDC predicts a continuous growth and need for these services as supply continues to catch up to demand.Founded in 2021 to shake up the $76 billion cloud storage market largely controlled by a few big tech companies, Seal Storage provides Web3 data storage for enterprises, research institutes, and Web3 firms in need of a more sustainable, secure, and affordable home for their valuable data. Michael Horowitz, the CEO; Andrew McFarlane, CIO; and Alex Altman, COO, are the founders of Seal Storage and have been working in blockchain for the past five years on a quest to revolutionize the cloud storage industry and make Web3 accessible for all.Seal’s team previously held careers in traditional finance, cloud storage, and cybersecurity. As the blockchain industry developed, each team member seized the opportunity to be involved in the emerging tech for various reasons. The Filecoin network was of special interest to all of the founders due to it’s immutable nature, data preservation, security, and the ability to create real-world applications through Web3.In its early days, the Seal Storage team found that after speaking with current data storage customers with large and valuable data assets, a majority of them were overwhelmed with the task, paying too much in egress fees, and expressed concern over losing control of their own data once in the cloud. The Seal Storage team jumped at this challenge and began to build a different kind of solution than what’s been offered, to tackle control, costs, and the amount of customer-input needed.“Present day costs to store large +PB scale datasets into centralized storage is cost prohibitive and the egress charges alone to access your data is a challenge for our customers. Seal Storage provides the same access workflows that our customers are accustomed to, without a decrease in productivity, and most importantly at a fraction of the cost,” said Jacques Swanepoel, CTO at Seal Storage.Keeping an eye on IPFSAfter a few years, Michael, Andrew, and Alex began taking note of the growth of IPFS and the successful Filecoin mainnet launch in the decentralized storage space, and began building a technical team to serve as the foundation for Seal Storage. In Dec 2021, Seal Storage officially joined the larger Filecoin network, as one of the earliest storage providers.As Seal Storage continued to build out its team and nodes on the Filecon network, the team began stewarding clients into decentralized cloud storage. They were effective by showing clients the cost savings, security, and added sustainability that the company could provide any entity with large data sets, powered by renewable energy.What’s Ahead: Onboarding Real Use-Cases to Web3Now a leader in the ecosystem, Seal Storage is continually adding more capacity to the Filecoin network and bringing in new organizations that are in need of the benefits that decentralized storage provides.Because Seal Storage’s platform is built on Filecoin, the company is incentivized to protect data and earn block rewards, enabling the company to provide free storage to universities and institutions, and preventing them from paying thousands to store valuable data on centralized platforms.“Filecoin has proved advantageous for users/customers that have a large data footprint problem. This could range from research institutions that are generating large datasets, to institutions that retain backup data that needs to be accessed infrequently. These customers typically keep data on tape for retrieval, and the challenge of retaining this data equates to refreshing the tape infrastructure hardware, which in PB-sized environments is a time- and resource-consuming experience,” says Jacques. “The Filecoin network overcomes these challenges with PB-scale storage, and the ability to select the duration of the data, which in some cases could be indefinite.”Seal Storage decided to provide storage on the Filecoin network because:Verifiable and reliable storage: Filecoin’s built-in processes check the history of files and verify that they have been stored correctly over time. Because every storage provider proves that they are maintaining their files in every 24-hour window, Seal Storage’s clients can efficiently scan this history to confirm that their files have been stored correctly, and any observer can check any storage provider’s track record and will notice if the provider has been faulty or offline in the past.Open market: On the Filecoin network, file storage and retrieval deals are negotiated in open markets. By lowering the barriers to entry, Filecoin enables a thriving ecosystem of many independent storage providers.Competitive prices: Prices for storage and retrieval are determined by supply and demand, not corporate pricing departments. The Filecoin network makes reliable storage available at hyper-competitive prices.The Seal Storage teamSeal is an established leader in the ecosystem. The team is made up of enterprise data experts from Seagate, Oracle, and Cisco, and the company has established itself as a top storage provider in North America, with more than 20PB of capacity across the U.S. and Canada, with more on the way.CEO and Co-Founder — Michael Horowitz — a seasoned financial and capital markets professional. He previously held principal portfolio management and advisory roles with a $100mm family office venture debt fund. Michael also held senior executive positions within the capital markets groups of both the Canadian Imperial Bank of Commerce (CIBC) and the Bank of Montreal (BMO).CIO and Co-Founder — Andrew McFarlane — bringing more than four years of blockchain engineering and business experience, Andrew is deep in the crypto space having launched node infrastructure and invested in 20+ cryptonetworks. Andrew specialized in cybersecurity at Deloitte, and built network infrastructure for video streaming at Canada’s largest telecom. Andrew holds a bachelor’s degree in Computer Engineering and an MBA from The University of Toronto.COO and Co-Founder — Alex Altman — an established leader in the Canadian crypto space, with 5+ years of experience as an investor, consultant and financial manager. Alex began his career working in private equity where he was directly involved with the diligence and underwriting of investment opportunities primarily in the real-estate space.CTO — Jacques Swanepoel — bringing 30 years of experience as a chief technology officer, entrepreneur and software engineer, Jacques is an expert in virtualization, disaster recovery planning, designing and managing multi-cloud solutions. He has in-depth knowledge of a vast range of networking and storage systems, including distributed systems.Seal’s success to dateSeal Storage now stores data for organizations and companies including UC Berkeley, Starling Lab, and Casper Network — all of which were in need of verifiable, secure storage for various types of data.Specifically, Seal Storage partnered with the UC Berkeley Orebi Gann Group to provide secure and immutable storage for large research data sets on neutrinos (think: black holes, exploding stars, and the Big Bang). Because it’s a challenge to uncover these ‘ghost particles’ the Berkeley Group created a detector called Theia to help collect clues about the origins of the universe and push the boundaries of research in particle and nuclear astrophysics. Given the size of these detectors and the large amount of data they can collect, Berkeley was in need of a large secure storage provider — which is where Seal Storage and the Filecoin network came in.Starling Lab, the first center in the world dedicated to using decentralized tools to advance human rights, works with Seal Storage to store their archive of testimony on the Holocaust and other genocides, keep record of the 78-day presidential transition from Donald Trump’s administration, store photos taken by Reuters journalists to create location, time, and date metadata, and recently began working with Syrian human rights organization Hala Systems, which is using the image provenance technology in aid in court presidings to present evidence of war crimes.And Casper Network, an open source blockchain optimized for enterprise and developer adoption, partnered with Seal Storage to better secure its NFTs against the risk of loss and manipulation by providing secure scalable storage and provenance. Seal Storage’s solution will provide Casper Network with NFT media backup, insurance, and encryption.Growing within the networkSeal Storage continues to add more capacity and bring new data clients to the Filecoin network and its other storage provider partners, and is now looking to expand that support by even more. Seal Storage has plans to add over 100 PiBs of data storage to the network, and currently has projects in the pipeline that could extend that addition.The team believes that decentralized storage is a building block to Web3, and is continually looking for ways to further encourage the next generation of the decentralized internet.Learn more about Seal Storage.And to learn more about Filecoin, storage providers and developer use cases, please visit: Filecoin.io or fil.org.",
    "link": "https://filecoinfoundation.medium.com/case-study-seal-storage-making-web3-accessible-for-all-through-ecosystem-leadership-and-the-dc3b60fad590?source=rss-5ae65b323734------2",
    "pubDate": "Thu, 22 Sep 2022 16:44:20 GMT"
  },
  {
    "title": "Everything You Need to Know About FIP0036 — Deliberation, Discussion, and Next Steps",
    "description": "No Description",
    "content": "Everything You Need to Know About FIP0036 — Deliberation, Discussion, and Next StepsThe Filecoin community has spent the past several months debating FIP0036 — Introducing a Sector Duration Multiple for Longer Term Storage Commitment. The FIP was authored by researchers at the CryptoEconLab (CEL), an organization in the Protocol Labs Network that’s responsible for contributing to the design, validation, monitoring, and development of the Filecoin economy. Researchers from CEL often contribute thinking and research to support Core Devs in their analysis of the security and technical feasibility of draft FIPs. They are also frequent FIP authors and collaborators, having contributed to the design of both Filecoin Plus and Hyperdrive, among other projects.With FIP0036, the CryptoEconLab has proposed economic changes that seek to better align network incentives to support the long-term growth and development of the Filecoin network. Specifically, this FIP proposes to:Increase minimum sector duration time from six months to 1 year.Increase the maximum sector duration time from 1.5 years to 3.5 years.Introduce a Sector Duration Multiplier for all sectors, regardless of deal type.The multiplier is linear, and corresponds to sector term length. — Any sectors committed for longer than 1 year will receive a multiplier in accordance to the length of their commitment. So, a sector committed for 2 years would receive a 2x multiplier in the calculation of their Quality Adjusted Power (QAP).—The maximum multiplier would be 3.5x, which corresponds to the proposed 3.5 year sector term maximum. — Storage providers could commit sectors for any period of time between 1 and 3.5 years and their multiplier would be adjusted accordingly.The Sector Duration Multiplier would compound with the Filecoin Plus deal multiplier that already exists in the network. — Thus, if a sector were committed for the maximum term period and filled 100% with Filecoin Plus deals, that storage provider would receive the maximum compounded multiplier of 35x (10x Filecoin Plus multiplier, compounded with the 3.5x term length multiplier).Increase Sector Initial Consensus Pledge multiplier from 30% to 50%.The FIP further specifies that any changes to QAP will occur only during 1) new sector pledges, and/or 2) sector extension. Newly proposed sector duration minimums and maximums will be introduced gradually (increasing by six months every week until the specified bounds are met) to minimize network shocks and better support storage providers.Read on to understand the background, considerations, and FIL Poll, a unique polling tool built for the Filecoin community that will allow storage providers, token holders, Core Devs, and deal clients to vote to reject or accept the FIP.Long-term goals, short-term challengesFIP0036 was introduced to the Filecoin community in June 2022, setting off an in-depth debate that led to ‘Ask Me Anything’ (AMA) sessions, conversational panels, debates within network working groups, and more than five different iterations of the FIP draft itself.The OpportunityProponents of the FIP have long argued that the proposed changes are necessary for ensuring the Filecoin network against a tough macroeconomic climate. According to Vik Kalghatgi, one of the FIP authors, FIP0036 is critical for “…further aligning economic incentives with the long-term growth, development, and mission of the network.”FIP0036 specifically seeks to align economic incentives by affecting parameters which significantly influence network circulating supply. Circulating supply is a critical metric for indicating overall Filecoin network health and performance. Because storage providers are required to provide token collateral on par with the amount of storage resources being committed, enabling (and incentivizing) longer term storage commitment means that more tokens will be “locked up” within the network.This token “lock up” positively affects circulating supply by ensuring that resources are committed long-term to the network. This long-term commitment will enable the network to scale more efficiently since longer sector terms alleviate the need to find greater sealing throughput as more and more storage providers onboard to the network. The “lock up” also seeks to introduce more stable network conditions for both storage providers and data clients.According to FIP authors and proponents, FIP0036 introduces changes to the Filecoin economy that are critical for the next phase of network growth and countering global macroeconomic pressures. However, some community members have raised concerns about the short-term cost pressures that these changes would introduce.The ChallengeIn community forums, some storage providers have raised concerns that their business models cannot support an increase in upfront collateral costs. Lending programs for Filecoin tokens are still developing, making it difficult to quickly or affordably increase investment capital. And some storage providers have argued that these changes will inspire a rush to accumulate liquidity, which could decrease the number of operational storage providers. Such an impact would affect the storage provider community, and could lead to an uptick in centralization among large storage providers.Others have raised questions about the integrity of assumptions around circulating supply, and have expressed uncertainty that affecting circulating supply will, in fact, support the goals of the FIP to better align economic incentives to support long term growth of the Filecoin network.Community Governance of FIP0036 + FIL PollFIP0036 has presented a complex challenge for community members, who have spent months publicly deliberating the trade-offs introduced by the FIP.This level of scrutiny has also challenged Filecoin community governance processes.By definition, FIPs are designed to support changes to the underlying Filecoin protocol. As a result, these proposals are often technically complex without significantly changing the social, economic, or operational logic of the broader Filecoin ecosystem. To support these FIPs, a ‘soft consensus’ model is used, allowing community members to opt into governance processes when they choose to, without requiring their participation to pass FIPs necessary for routine protocol maintenance and development.Unfortunately, acceptance through ‘soft consensus’ is not possible when community members deeply disagree about whether to accept or reject the FIP draft. As a result, Filecoin Foundation will launch FIL Poll to help community members advocate for their preference and reach general consensus.FIL Poll is a polling tool that allows storage providers, token holders, Core Devs, and deal clients to vote to reject or accept the FIP. The poll will be open from Weds., Sept.14 through Weds., Sept. 28. This polling period will serve as the ‘Last Call’ period for FIP0036.If accepted, Core Devs have already agreed to schedule this FIP for inclusion in the v17 network upgrade. This inclusion was specifically requested by FIP authors, arguing that the specification of the FIP is time sensitive and premised on current network conditions.If rejected, the FIP will no longer be considered by the community. FIP authors are of course welcome to author a new FIP, but FIP0036 will be considered final. In its current form, it will not be eligible for reconsideration or inclusion in future network upgrades.For more information about this FIP check out this recent AMA. And for more details about the FIL Poll process, see HERE. To cast your vote, or ask for technical support with the voting tool, see HERE.",
    "link": "https://filecoinfoundation.medium.com/everything-you-need-to-know-about-fip0036-deliberation-discussion-and-next-steps-fe6eb48b25ee?source=rss-5ae65b323734------2",
    "pubDate": "Fri, 16 Sep 2022 17:03:36 GMT"
  },
  {
    "title": "Announcing the Public Data Commons and Awards Program",
    "description": "No Description",
    "content": "We’re excited to announce that today Filecoin Foundation is launching a Public Data Commons initiative to support open data projects in partnership with government and official organizations across the globe. This project brings together cutting-edge archival technologies and civic-minded public institutions to leverage the unique benefits of decentralized storage — because public data should be a useful resource, not a costly burden to store.Additionally, as part of this initiative, we’re launching a Public Data Explorer Awards program, geared toward funding the work of local nonprofits and civic technology groups to store, access, and/or analyze their community datasets on the decentralized web. The Public Data Explorer Awards will provide up to $50,000 of funding per city. This award is intended to fund anything from a project analyzing air quality data recently uploaded to Filecoin to an educational seminar about how to access and use your city’s data stored on Filecoin or IPFS. Do you represent a city interested in encouraging people to build on open data? Please reach out to publicdata@fil.org to learn more.We believe that public data belongs in the hands of the people. However, according to the Open Data Barometer, fewer than 1 in 5 datasets are open, meaning they are easily accessible and available. Open data helps foster trust in governments by allowing citizens and community organizations to engage directly with governments and promote accountability for a more effective government. Data infrastructure is a huge part of this — enabling local, state, and national governments in making data available.However, on today’s centralized web, the data that cities and citizens use sits in data warehouses owned largely by a handful of companies. When these companies suffer blackouts, vast swaths of the web can go down for hours, including websites that are massive contributors to the economy. That’s the problem with centralized servers — they create a single point of failure. On a decentralized web, websites will stay up even if some nodes fail, and, most importantly, the availability of information is not dependent on any one server or company.In December 2021, in an effort to understand how decentralized technology can help cities better deliver for their citizens, we partnered with Protocol Labs to enable New York City to expand its Open Data project. The goal of the partnership — which spans five years and comes at no cost to the city — is to expand accessibility and improve accountability and transparency, in order to foster trust and enable more engagement from stakeholders.Working with the city’s technology team, the Foundation identified several data sets that were part of the city’s Open Data project. These data sets represent particularly foundational categories of knowledge that enable New York City to be a better place to live and work. Those data sets include:City Record Online (CROL): a searchable database that holds all notices published in the City Record newspaper. These notices include information on procurement requests for proposals and awarded projects, notices of public hearings and meetings, public auctions and sales, and rules proposed and established by city agencies.Air Quality Surveillance Data: a database of reported levels of air pollution over time and across all NYC boroughs to measure the air quality and health across the city.City Demographics by Geography: a set of data and tools hosted by the city planning department that address areas such as housing and economics, population, transportation, urban design, and the waterfront.To learn more about the Foundation’s public data initiative, visit fil.org/public-data.",
    "link": "https://filecoinfoundation.medium.com/announcing-the-public-data-commons-and-awards-program-69a4db548169?source=rss-5ae65b323734------2",
    "pubDate": "Thu, 15 Sep 2022 13:16:33 GMT"
  },
  {
    "title": "Spotlight: New Filecoin Virtual Machine Projects Unlocking Smart Contract Programmability",
    "description": "No Description",
    "content": "The Filecoin community is expanding the network to create a decentralized, efficient, and robust platform for humanity’s data by introducing programmability to the network.The Filecoin Virtual Machine (FVM) is bringing smart contract programmability to the Filecoin storage network, enabling users to deploy their own smart contracts, or actors, as they are termed in the Filecoin ecosystem.This fully Ethereum Virtual Machine (EVM) compatible additional layer of capability, will unlock boundless possibilities for innovation, including use cases that would not be possible in a traditional cloud storage world.Some of the new and powerful use cases that the FVM will enable includes Data DAOs, the Dataverse, and tokenized datasets. The EVM-compatible FVM will also unlock smarter storage networks with the ability to build perpetual and self-repairing storage deals, trustless reputation systems, and trustless aggregated storage deals. Plus DeFi use cases such as lending markets, decentralized exchanges, automated market makers, and many more.Last month, the Skyr upgrade introduced Milestone 1 of the FVM, one of the largest upgrades in Filecoin network history. The Skyr upgrade also laid the groundwork for Milestone 2.1 of the FVM which will bring EVM smart contract deployments to the Filecoin network. FVM-native development will also continue in parallel, with developer teams building out core tooling and laying the infrastructure of the future development experience for the network.New FVM ProjectsA few recent projects creating new FVM tools and services with support from the Filecoin Foundation’s Dev Grants program:Zondax — Combining FVM and Assemblyscript, Zondax is developing an easy-to-use software development kit (SDK) for the developers that are more familiar with Javascript-like languages. Zondax will build a set of tools to use AssemblyScript to write new smart contracts that will compile to WebAssembly (or WASM) code at the end. Currently, there are two SDKs for FVM smart contracts: Go and Rust. Zondax will add the popular and widely-used Javascript/Typescript family. Learn more about Zondax’s FVM project and watch a demo.Polyphene — At the forefront of development for the native FVM, Polyphene is integrating a testing library into the main code base and developing a high-level Rust SDK to make the FVM accessible to everyone. Watch a demo of Polyphene’s Rust SDK and developers can learn more about the possibilities with the SDK in the documentation repository. The project is currently in beta phase and Polyphene is looking for feedback on this SDK. Learn more about Polyphene’s FVM project here.IPFSForce — The team behind the Venus implementation of the Filecoin network is working on a TinyGo SDK for the FVM.Yatima — Sitting at the intersection of formal proofs and zero-knowledge proofs, Yatima is integrating Lurk, a programming language for Turing-complete recursive zkSNARKs with FVM. This will enable zero-knowledge proofs written in Lurk to be verified natively on Filecoin, enabling implementation of simple examples of zero-knowledge applications such as proofs of membership, private tokens, WASM, or EVM state rollups. Yatima plans to create several novel applications of the Lean-Lurk-FVM stack, such as an on-chain marketplace where parties can trustlessly buy and sell verifiably correct typed programs and data. Learn more about Yatima’s FVM project.Filecoin Foundation’s Dev Grants program is advancing projects and aims to award additional grants to boost development in the Filecoin ecosystem. Check out our other grant recipients and learn how you can apply for Open Grants and Microgrants.Join the FVM Foundry’s Early Builders ProgramWe are seeking individuals and teams with expertise in smart contract programming (on EVM) to join the FVM Foundry. If you’re a Solidity developer or team, this is an opportunity to hit the ground running as features become available and become a pioneering member of the FVM Foundry. Participants should have knowledge in distributed/blockchain systems, web3, smart contract programming, and/or decentralized storage. Visit the FVM homepage to learn more.Learn About FVM at FIL-Singapore (Sept. 26–27)FIL-Singapore is slated to be the largest in-person Filecoin gathering in Asia. Join the Filecoin community September 26–27, at the Marina Bay Sands in Singapore, ahead of Token2049, for two packed days of talks, workshops and networking events. Discussions will include the latest on FVM progress, updates on the Filecoin Roadmap, Filecoin cryptoeconomics, and more. Use the promo code FFVIP for free registration.To learn more, watch this playlist of FVM videos.",
    "link": "https://filecoinfoundation.medium.com/spotlight-new-filecoin-virtual-machine-projects-unlocking-smart-contract-programmability-5d03e692ad13?source=rss-5ae65b323734------2",
    "pubDate": "Mon, 12 Sep 2022 17:02:32 GMT"
  },
  {
    "title": "Filecoin Foundation and Blockchain Law for Social Good Center Accelerate Web3 Education",
    "description": "No Description",
    "content": "New Blockchain Academy Lab will provide education and training to support understanding of decentralized technologyFilecoin Foundation is thrilled to announce its award to the Blockchain Law for Social Good Center at Golden Gate University School of Law to create the Filecoin Foundation Blockchain Academy Lab (the Lab). With the Filecoin Foundation’s support, the Lab will create opportunities for students and others to learn about decentralized storage, technologies behind Web3, and the next generation of the internet. The Filecoin Foundation Blockchain Academy Lab will host meetups, various trainings, and other events that broaden the understanding of open and decentralized technologies, and how they can be harnessed for good.“Over the past year, we’ve seen a surging interest in the technology powering cryptocurrency and Web3,” said Michele Neitz, Blockchain Law for Social Good Center Founding Director. “As a Bay Area law school, we want to provide our students–and our larger community–with the resources they need to learn about these innovative, emerging technologies and their socially beneficial uses. With Filecoin Foundation’s support, we’re excited to create a curriculum to meet the growing demand for educational resources.”With the support of this award, the Lab will create specialized programs such as the Community College Professor Training Program, an exciting effort that will begin in Bay Area community colleges with the aim to expand to the Central Valley’s underserved communities in order to empower more professors with knowledge about decentralized technology. The Lab will also host monthly workshops tailored for state and local government offices and launch the Teaching Fellow Program, an initiative to prepare the next generation of blockchain experts in legal education and foster champions within academia who can impart the benefits of open, decentralized technologies to future generations.The Lab will be accessible to individuals around the world interested in the decentralized web, through video-conferencing and virtual events.“We are excited to partner with the Blockchain Law for Social Good Center to create the Filecoin Foundation Blockchain Academy Lab,” said Marta Belcher, president and chair of the Filecoin Foundation. “We are thrilled to work together to provide education about the next generation of the Web.”To learn more about upcoming events at the Filecoin Foundation Blockchain Academy Lab, visit https://blockchainlawsg.org/projects/.",
    "link": "https://filecoinfoundation.medium.com/filecoin-foundation-and-blockchain-law-for-social-good-center-accelerate-web3-education-6ce5ff147a4f?source=rss-5ae65b323734------2",
    "pubDate": "Wed, 07 Sep 2022 13:01:10 GMT"
  }
]
